Repository: mozilla-l10n/mt-training-data
Catalog: su/su_pontoon.tmx
Source language: en_us
Languages: su

source: %1$d new permissions are required
su: %1$d idin anyar dipikabutuh

source: %1$d out of %2$d
su: %1$d ti %2$d

source: %1$d selected
su: %1$d dipilih

source: 1. Go to Android Settings
su: 1. Buka Setélan Android

source: 1 open tab. Tap to switch tabs.
su: 1 tab muka. Toél pikeun pindah tab.

source: %1$s add-ons
su: %1$s add-on

source: %1$s can’t download this file type
su: %1$s teu bisa ngundeur tipe berkas kieu

source: %1$s clears your search and browsing history from private tabs when you close them or quit the app. While this doesn’t make you anonymous to websites or your internet service provider, it makes it easier to keep what you do online private from anyone else who uses this device.
su: %1$s meresihan jujutan sungsian jeung pamaluruhan ti tab pribadi nalika anjeun nutup jeung kaluar ti aplikasi. Najan henteu matak anonim ka raramatloka atawa panyadia layanan internét anjeun, bakal leuwih gampang pikeun ngajaga anu dipigawé jering tetep nyamuni ti batur nu maké ieu piranti.

source: %1$s clears your search and browsing history when you quit the app or close all private tabs. While this doesn’t make you anonymous to websites or your internet service provider, it makes it easier to keep what you do online private from anyone else who uses this device.
su: %1$s meresihan jujutan sungsian jeung langlangan nalika anjeun kaluar ti aplikasi atawa nutup sakabéh tab nyamuni. Najan henteu matak anonim ka raramatloka atawa panyadia layanan internét anjeun, bakal leuwih gampang pikeun ngajaga anu dipigawé jering tetep nyamuni ti batur nu maké ieu piranti.

source: %1$s has a new update
su: %1$s boga apdét anyar

source: %1$s has been added to %2$s
su: %1$s geus ditambahkeun ka %2$s

source: %1$s is produced by Mozilla.
su: %1$s dihasilkeun ku Mozilla.

source: %1$s is requesting your username and password.
su: %1$s ménta sandiasma jeung kecap konci anjeun.

source: %1$s on %2$s %3$s
su: %1$s dina %2$s %3$s

source: %1$s open tabs. Tap to switch tabs.
su: %1$s tab muka. Toél pikeun pindah tab.

source: %1$s (Private Mode)
su: %1$s (Mode Nyamuni)

source: %2$s is requesting your username and password. The site says: “%1$s”
su: %2$s ménta sandiasma jeung kecap konci anjeun. Situsna nyebutkeun: “%1$s”

source: 2. Tap <b>Permissions</b>
su: 2. Buka <b>Idin</b>

source: 3. Toggle <b>%1$s</b> to ON
su: 3. Gilir <b>%1$s</b> ka ON

source: About
su: Ngeunaan

source: About %1$s
su: Ngeunaan %1$s

source: Accept and edit suggestion
su: Tampa jeung édit saran

source: Accept the Risk and Continue
su: Tampa Risiko jeung Teruskeun

source: Access browser activity during navigation
su: Aksés kagiatan panyungsi salila navigasi

source: Access browser tabs
su: Aksés tab panyungsi

source: Access browsing history
su: Aksés jujutan langlangan

source: Accessibility
su: Aksésibilitas

source: Access recently closed tabs
su: Aksés tab nu anyar ditutup

source: Access to the file was denied
su: Aksés ka berkas ditolak

source: Access your data for %1$s
su: Aksés data anjeun pikeun %1$s

source: Access your data for all websites
su: Aksés data anjeun pikeun sakabéh raramatloka

source: Access your data for sites in the %1$s domain
su: Aksés data anjeun pikeun loka dina domain %1$s

source: Access your data on %1$d other domains
su: Aksés data anjeun dina %1$d domain séjén

source: Access your data on %1$d other sites
su: Aksés data anjeun dina %1$d loka séjén

source: Access your data on 1 other domain
su: Aksés data anjeun dina 1 domain séjén

source: Access your data on 1 other site
su: Aksés data anjeun dina 1 loka séjén

source: Access your location
su: Aksés lokasi anjeun

source: Account
su: Akun

source: Account settings
su: Setélan akun

source: A completely redesigned browser awaits, with improved performance and features to help you do more online.\n\nPlease wait while we update %s with your
su: Pamaluruh wanda anyar geus nungguan, kalawan kinerja anu ngaronjat sarta pitur anu mantuan jering anjeun leuwih loba.\n\nMangga tungguan sabot kami ngapdét %s anjeun

source: Adapts to your device settings
su: Luyukeun jeung setélan paranti

source: Add
su: Tambah

source: Add %1$s?
su: Tambahkeun %1$s?

source: Add %1$s and %2$s to %3$s
su: Tambahkeun %1$s jeung %2$s ka %3$s

source: Add %1$s to %2$s
su: Tambahkeun %1$s ka %2$s

source: Add a shortcut to open private tabs from your Home screen.
su: Tambah takulan ka tab pribadi nu muka ti layar Tepas.

source: Added to top sites!
su: Ditambahkeun kana loka kawentar!

source: Add folder
su: Tambah map

source: Add new collection
su: Nambihkeun koléksi anyar

source: Add-on collection modified. Quitting the application to apply changes…
su: Koléksi Émboh geus dirobah. Kaluar ti aplikasi pikeun nerapkeun parobahan…

source: Add-on is already installed
su: Émboh geus dipasang

source: Add-on is not supported
su: Emboh teu didukung

source: Add-ons
su: Add-on

source: Add-ons Manager
su: Manajer Émboh

source: Add-on updates
su: Apdét add-on

source: Add private browsing shortcut
su: Tambahan tarabas nyungsi nyamuni

source: Add private tab
su: Tambah tab nyamuni

source: Address bar
su: Palang alamat

source: Address Not Found
su: Alamat Teu Kapanggih

source: Add search engine
su: Tambah mesin pamaluruh

source: Add shortcut
su: Tambah takulan

source: Add tab
su: Tambah tab

source: Add them to %1$s
su: Tambahkeun kabéhanana ka %1$s

source: Add to contact
su: Tambahkeun ka kontak

source: Add to Home screen
su: Tambahkeun ka layar Tepas

source: Add to top sites
su: Tambahkeun ka loka kawentar

source: Add username to saved password?
su: Tambahkeun sandiasma kana kecap sandi anu diteundeun?

source: Add widget
su: Tambihkeun widget

source: Advanced
su: Terusan

source: Advanced…
su: Leuwih lengkep…

source: After one day
su: Sanggeus sapoé

source: After one month
su: Sanggeus sabulan

source: After one week
su: Sanggeus saminggu

source: All actions
su: Sadaya lampah

source: All cookies (will cause websites to break)
su: Sakabéh réréméh (bakal ngabalukarkeun raramatloka jadi teu bener)

source: Allow
su: Idinan

source: ALLOW
su: IDINAN

source: Allow %1$s to open %2$s
su: Idinan %1$s muka %2$s

source: Allow %1$s to play DRM-controlled content?
su: Idinan %1$s pikeun maénkeun kontén anu diatur ku DRM?

source: Allow %1$s to send notifications?
su: Idinan %1$s pikeun ngirim iber?

source: Allow %1$s to store data in persistent storage?
su: Idinan %1$s pikeun nyimpen data dina panyimpenan anu tetep?

source: Allow %1$s to use your camera?
su: Idinan %1$s maké kaméra anjeun?

source: Allow %1$s to use your camera and microphone?
su: Idinan %1$s maké kaméra jeung mikropon anjeun?

source: Allow %1$s to use your location?
su: Idinan %1$s maké lokasi anjeun?

source: Allow %1$s to use your microphone?
su: Idinan %1$s maké mikropon anjeun?

source: Allow audio and video
su: Ngidinan sora jeung pidéo

source: Allowed
su: Idinan

source: Allow in private browsing
su: Idinan dina langlangan pribadi

source: Allow screenshots in private browsing
su: Ngidinan layar dina langlangan nyamuni

source: Allow search suggestions in private sessions?
su: Idinan saran pamaluruhan dina sési nyamuni?

source: Allows Mozilla to install and collect data for experimental features
su: Ngidinan Mozilla masang sareng ngumpulkeun data kanggo fitur ékspérimén

source: Allows Mozilla to install and run studies
su: Ngidinan Mozilla masang jeung ngajalankeun studi

source: All third-party cookies (may cause websites to break)
su: Sakabéh réréméh pihak katilu (bisa ngabalukarkeun raramatloka jadi teu bener)

source: A login with that username already exists
su: Login maké éta sandiasma geus aya

source: Alphabetically
su: Sacara abjad

source: Already have an account?
su: Geus boga akun?

source: Always
su: Matuh

source: A new permission is required
su: Perlu idin anyar

source: Appearance
su: Pidangan

source: Are you sure?
su: Anjeun yakin?

source: Are you sure that you want to clear all the permissions for this site?
su: Yakin rék ngaberesihan sadaya idin di ieu loka?

source: Are you sure that you want to clear all the permissions on all sites?
su: Yakin rék ngaberesihan sadaya idin di sadaya loka?

source: Are you sure that you want to clear this permission for this site?
su: Yakin rék ngaberesihan ieu idin di ieu loka?

source: Are you sure you want to clear your downloads?
su: Yakin rék meresihan undeuran anjeun?

source: Are you sure you want to clear your history?
su: Yakin rék meresihan jujutan anjeun?

source: Are you sure you want to delete %1$s?
su: Anjeun yakin rék mupus %1$s?

source: Are you sure you want to delete this bookmark?
su: Yakin anjeun rék mupus ieu markah?

source: Are you sure you want to delete this folder?
su: Yakin anjeun rék mupus ieu folder?

source: Are you sure you want to delete this login?
su: Yakin rék mupus ieu login?

source: A site is playing media
su: Loka nuju maén média

source: Ask to allow
su: Nyuhunkeun diidinan

source: Ask to save
su: Naros keur neundeun

source: Audio and video will play on Wi-Fi
su: Sora jeung pidéo bakal dimaénkeun dina Wi-Fi

source: Aug
su: Agu

source: Authors
su: Pamilik

source: Autocomplete URLs
su: Otokumplit URLs

source: Autofill
su: Eusi otomatis

source: Automatic
su: Otomatis

source: Automatically deletes browsing data when you select "Quit" from the main menu
su: Otomatis mupus data nyungsi nalika anjeun milih tombol "Kaluar" ti menu utama

source: Automatically deletes browsing data when you select \"Quit\" from the main menu
su: Otomatis mupus data nyungsi nalika anjeun milih \"Kaluar\" ti menu utama

source: Automatic font sizing
su: Ukuran font otomatis

source: Automatic privacy
su: Salindungan otomatis

source: Back
su: Mundur

source: Basics
su: Dasar

source: Block audio and video
su: Peungpeuk audio jeung pidéo

source: Block audio and video on cellular data only
su: Blokir sora jeung pidéo dina data sélulér wungkul

source: Block audio only
su: Blokir sora hungkul

source: Block content and scripts that track you online
su: Peungpeuk kontén jeung skrip anu ngalacak anjeun jering

source: Blocked
su: Dipeungpeuk

source: Blocked by Android
su: Diblokir ku Android

source: Blocks cookies that ad networks and analytics companies use to compile your browsing data across many sites.
su: Meungpeuk réréméh anu dipaké ku maskapé jaringan iklan jeung analitika pikeun ngumpulkeun data langlangan anjeun di loka anu kaanjangan.

source: Blocks fewer trackers. Pages will load normally.
su: Peungpeuk palacak leuwih saeutik. Kaca bakal muka leuwih normal.

source: Blocks more trackers, ads, and popups. Pages load faster, but some functionality might not work.
su: Peungpeuk palacak, iklan, jeung popup. Kaca muka leuwih gancang, tapi sababaraha pungsionalitas bisa teu jalan.

source: Bookmark
su: Markah

source: Bookmark created.
su: Markah dijieun.

source: Bookmark menu
su: Menu markah

source: Bookmarks
su: Markah

source: Bookmark saved!
su: Markah diteundeun!

source: Bookmarks deleted
su: Mupus markah

source: Bookmarks Menu
su: Menu markah

source: Bookmarks saved!
su: Markah diteundeun!

source: Bookmarks Toolbar
su: Palang Parabot Markah

source: Bottom
su: Handap

source: Browse privately
su: Nyungsi nyamuni

source: Browse without being followed
su: Nyungsi bari teu dituturkeun

source: Browsing data deleted
su: Data panyungsi pupus

source: Browsing history
su: Jujutan nyungsi

source: Browsing history and site data
su: Jujutan nyungsi jeung data loka

source: Cached images and files
su: Berkas jeung gambar dina telih

source: Call
su: Gero

source: Call with…
su: Gero maké…

source: Camera
su: Kaméra

source: Camera access needed. Go to Android settings, tap permissions, and tap allow.
su: Butuh aksés kaméra. Buka setélan Android, toél idin, laju toél idinan.

source: Camera and microphone are on
su: Kaméra jeung mikropon hurung

source: Camera is on
su: Kaméra hurung

source: Cancel
su: Bolay

source: Cannot Complete Request
su: Rekés Gagal

source: Cannot share to this app
su: Teu bisa ngabagi ka aplikasi ieu

source: Can’t edit default folders
su: Teu bisa ngédit folder baku

source: Change the layout of open tabs. Go to settings and select grid under tab view.
su: Ngarobah perenah tab anu maruka. Buka setélan tur pilih grid handapeun témbongan tab.

source: Check that search string matches Example format
su: Pariksa yén string pamaluruhan akur jeung format Conto

source: Check your network connection or try reloading the page in a few moments.
su: Pariksa sambungan jaringan anjeun atawa cobaan muat deui kacana engké.

source: Choose a color
su: Pilih kelir

source: Choose what to sync
su: Pilih nu rék disingkronkeun

source: Choose which trackers and scripts to block.
su: Pilih palacak jeung skrip mana anu rék dipeungpeuk.

source: Choose your theme
su: Pilih téma anjeun

source: Clear
su: Beresihan

source: Clear password
su: Beresihan sandi

source: Clear permission
su: Beresihan idin

source: Clear permissions
su: Beresihan idin

source: Clear permissions on all sites
su: Beresihan idin di sadaya loka

source: Clear recent browsing history, cookies, and related data
su: Beresihan jujutan langlangan, réréméh, jeung data nu tumali

source: Clears cookies set by redirects to known tracking websites.
su: Meresihan réréméh anu diatur ku alihan ka raramatloka palacak anu dipikawanoh.

source: Clear username
su: Beresihan sandiasma

source: Click for more details
su: Pencét sangkan leuwih écés

source: Close
su: Tutup

source: Close after one day
su: Tutup sanggeus sapoé

source: Close after one month
su: Tutup sanggeus sabulan

source: Close after one week
su: Tutup sanggeus saminggu

source: Close all tabs
su: Tutup kabéh tab

source: Close manually
su: Tutup manual

source: Close private tabs
su: Tutup tab nyamuni

source: Close reader view
su: Tutup panémbong pamaca

source: Close tab
su: Tutup tab

source: Close tabs
su: Tutup tab

source: Close tab %s
su: Tutup tab %s

source: Collapse suggested logins
su: Leutikan saran login

source: Collection %d
su: Koléksi %d

source: Collection deleted
su: Mupus koléksi

source: Collection menu
su: Menu koléksi

source: Collection name
su: Ngaran koléksi

source: Collection owner (User ID)
su: Pamilik koléksi (Sandiasma)

source: Collection renamed
su: Koléksi dingaranan

source: Collections
su: Koléksi

source: Collection saved!
su: Koléksi diteundeun!

source: Collect the things that matter to you
su: Kumpulkeun hal anu penting pikeun anjeun

source: Collect the things that matter to you.\nGroup together similar searches, sites, and tabs for quick access later.
su: Kumpulkeun anu parenting.\n Kumpulkeun pamaluruhan, loka, jeung tab anu sarupa sangkan jaga babari muka deui.

source: Common myths about private browsing
su: Mitos umum ngeunaan langlangan nyamuni

source: Complete action using
su: Anggeuskeun peta maké

source: Confirm
su: Sahkeun

source: Connect another device
su: Sambungkeun parangkat séjén

source: Connect another device.
su: Sambungkeun séjén paranti.

source: Connect Another Device…
su: Sambungkeun Parangkat Séjén…

source: Connect with a Firefox Account.
su: Sambungkeun maké Firefox Account.

source: Content crashed
su: Kontén ruksak

source: Content Encoding Error
su: Galat pengkodean kontén

source: Continue to website
su: Teruskeun ka loka

source: Control browser proxy settings
su: Atur setélan proksi panyungsi

source: Cookies
su: Réréméh

source: Cookies from unvisited sites
su: Réréméh ti loka anu teu dianjangan

source: Copy
su: Tiron

source: Copy email address
su: Tiron alamat surélék

source: Copy image location
su: Tiron pernah gambar

source: Copy link
su: Tiron tutumbu

source: Copy password
su: Niron sandi

source: Copy site
su: Niron loka

source: Copy username
su: Niron sandiasma

source: Corrupted Content Error
su: Galat Kontén Ruksak

source: Could not open file
su: Teu bisa muka berkas

source: Crashes
su: Karuksakan

source: Crash reporter
su: Laporan karuksakan

source: Crash Reports
su: Laporan Karuksakan

source: Created %s
su: Nyieun %s

source: Credit cards and addresses
su: Kartu kiridit jeung alamat

source: Cross-site and social media trackers
su: Palacak meuntas loka jeung média sosial

source: Cross-Site Tracking Cookies
su: Réréméh Palacak Meuntas-Loka

source: Cryptominers
su: Gurandil kripto

source: Current session image
su: Gambaran sési kiwari

source: Custom
su: Sakahayang

source: Custom Add-on collection
su: Koléksi Émboh sakahayang

source: Custom Firefox Account server
su: Serper Firefox Account biasa

source: Customize
su: Sesuaikeun

source: Custom search engine details
su: Wincikan mesin pamaluruh sakahayang

source: Custom Sync server
su: Serper Sync kustom

source: %d addresses
su: %d alamat

source: Dark
su: Poék

source: Dark color scheme
su: Skéma warna poék

source: Dark theme
su: Téma poék

source: Data choices
su: Pilihan data

source: Data collection
su: Koléksi data

source: Debug menu: %1$d click(s) left to enable
su: Menu debug: %1$d klik deui pikeun ngahurungkeun

source: Debug menu enabled
su: Menu debug geus hurung

source: Dec
su: Dés

source: Deceptive site issue
su: Masalah loka nu nipu

source: Default search engine
su: Mesin pamaluruh baku

source: Delete
su: Pupus

source: Delete %1$d items
su: Hapus %1$d item

source: Delete %1$s?
su: Pupus %1$s?

source: Delete all exceptions
su: Hapus sadaya pengecualian

source: Delete and Open
su: Hapus jeung Buka

source: Delete browsing data
su: Pupus data nyungsi

source: Delete browsing data on quit
su: Pupus data nyungsi nalika kaluar

source: Delete collection
su: Hapus koléksi

source: Deleted %1$s
su: Mupus %1$s

source: Delete downloads
su: Hapus undeuran

source: Deleted %s
su: Mupus %s

source: Delete from history
su: Pupus tina jujutan

source: Delete history
su: Hapus jujutan

source: Delete private tabs
su: Hapus tab nyamuni

source: Delete session
su: Hapus rintakan

source: Deleting browsing data…
su: Mupus data sungsian…

source: Deleting selected bookmarks
su: Ngahapus markah anu dipilih

source: Deleting selected folders
su: Mupus folder anu dipilih

source: Deleting this tab will delete the entire collection. You can create new collections at any time.
su: Mupus ieu tab bakal mupus sakabéh koléksi. Anjeun bisa nyieun koléksi anyar iraha baé.

source: Deny
su: Tolak

source: DENY
su: HULAG

source: Deselect All
su: Ulah Pilih Kabéh

source: Desktop Bookmarks
su: Markah Déstop

source: Desktop site
su: Loka déstop

source: Details
su: Rincian

source: Developer tools
su: Parabot pamekar

source: Device name
su: Ngaran parangkat

source: Device name cannot be empty.
su: Ngaran piranti teu bisa kosong.

source: Disabled
su: Dipareuman

source: Disable private browsing
su: Pareuman langlangan pribadi

source: Discard changes
su: Piceun parobahan

source: Disconnect
su: Pegatkeun

source: Dismiss
su: Tutup

source: Dismiss find in page
su: Tutup téangan dina kaca

source: Display notifications to you
su: Némbongkeun iber ka anjeun

source: Don’t allow
su: Hulag

source: Don’t save
su: Ulah diteundeun

source: Don’t update
su: Ulah ngapdét

source: Download
su: Undeur

source: Download (%1$s)
su: Undeur (%1$s)

source: Download completed
su: Ngundeur anggeus

source: Download failed
su: Ngundeur gagal

source: Download files and read and modify the browser’s download history
su: Undeur berkas sarta baca jeung ropéa jujutan undeur panyungsi

source: Downloading and verifying add-on…
su: Ngeundeur jeung verifikasi add-on…

source: Download link
su: Undeur tutumbu

source: Download paused
su: Ngundeur direureuhkeun

source: Downloads
su: Undeuran

source: Downloads Deleted
su: Undeuran geus dihapus

source: Downloads Removed
su: Undeuran Disingkahkeun

source: Do you want %s to save this login?
su: Loginna badé disimpen di %s?

source: Do you want to leave this site? Data you have entered may not be saved
su: Arék ninggalkeun ieu loka? Data anu geus diasupkeun bisa leungit

source: %d pages
su: %d kaca

source: DRM-controlled content
su: Kontén anu diatur ku DRM

source: %d tabs
su: %d tab

source: %d tab selected
su: %d tab dipilih

source: %d tabs selected
su: %d tab dipilih

source: Edit
su: Édit

source: EDIT
su: ÉDIT

source: Edit bookmark
su: Édit markah

source: Edit folder
su: Édit map

source: Edit search engine
su: Ropéa mesin pamaluruh

source: Email
su: Surélék

source: Email address copied to clipboard
su: Alamat surélék geus ditiron kana papan klip

source: Email with…
su: Surélékan maké…

source: Enabled
su: Dihurungkeun

source: Enable private browsing
su: Hurungkeun langlangan pribadi

source: Enable to allow pinch and zoom, even on websites that prevent this gesture.
su: Hurungkeun ngarah bisa niron jeung ngabadagan, najan dina raramatloka anu nyegah ieu pungsi.

source: Enhanced Tracking Protection
su: Protéksi Palacakan Tingkat Lanjut

source: Enhanced Tracking Protection is off for these websites
su: Protéksi Palacakan Tingkat Lanjut pareum dina ieu loka

source: Enter a search string
su: Asupkeun string pamaluruhan

source: Entered multiselect mode, select tabs to save to a collection
su: Asup mode lobapilih, pilih tab pikeun neundeun ka koléksi

source: Entering full screen mode
su: Asup ka mode layar pinuh

source: Enter search engine name
su: Asupkeun ngaran mesin pamaluruh

source: Error
su: Galat

source: Error connecting to “%s”
su: Masalah nyambungkeun ka “%s”

source: Every time the shield is purple, %s has blocked trackers on a site. Tap for more info.
su: Nalika taméngna bungur, %s geus meungpeuk palacak dina loka. Toél pikeun iber leuwih lengkep.

source: Exceptions
su: Iwal

source: Exceptions let you disable tracking protection for selected sites.
su: Pangiwalan bisa dipaké mareuman protéksi palacakan pikeun loka anu dipilih.

source: Exchange messages with apps other that this one
su: Kikirim surat maké aplikasi lian ti ieu

source: Exited multiselect mode
su: Kaluar mode lobapilih

source: Exit multiselect mode
su: Kaluar mode lobapilih

source: Expand suggested logins
su: Legaan saran login

source: Experiments
su: Éksperimén

source: Extend developer tools to access your data in open tabs
su: Legaan parabot depeloper pikeun ngaksés data anjeun dina tab anu muka

source: Extensions
su: Éksténsi

source: External download manager
su: Manajer undeuran éksternal

source: Failed to disable %1$s
su: Gagal numpurkeun %1$s

source: Failed to enable %1$s
su: Gagal ngahurungkeun %1$s

source: Failed to install %1$s
su: Gagal masang %1$s

source: Failed to query Add-ons!
su: Gagal pikeun pamundut Add-on!

source: Failed to remove %1$s
su: Gagal miceun %1$s

source: Failed to sign-in
su: Gagal asup

source: Failed to uninstall %1$s
su: Gagal ngabongkar %1$s

source: Feb
su: Péb

source: File Not Found
su: Berkas Teu Kapanggih

source: Fill link from clipboard
su: Eusian tutumbu tina papan klip

source: Find in page
su: Panggihan dina kaca

source: Find next result
su: Téang hasil séjén

source: Find previous result
su: Téang hasil saméméhna

source: Fingerprinters
su: Sidik ramo

source: Firefox Account
su: Akun Firefox

source: Firefox Account/Sync server modified. Quitting the application to apply changes…
su: Serper Firefox Account/Sync geus dirobah. Kaluar ti aplikasi pikeun nerapkeun parobahan…

source: Firefox add-on technology is modernizing. These add-ons use frameworks that are not compatible with Firefox 75 & beyond.
su: Téhnologi add-on Firefox keur dimodérenkeun. Ieu add-on maké rarangka anu henteu cocog jeung Firefox 75 & sanggeusna.

source: Firefox is updated - and improved!
su: Firefox geus dimutahirkeun - sarta dironjatkeun!
